csmlucky/Cortex-M4-Stm32F4-Drivers/Src/014rtc_testing.c
/*
 * 004spi_tx_testing.c
 *
 *  Created on: Aug 12, 2025
 *      Author: csmla
 *
 *      RTC Testing
 *      Set and Get TIme, Date
 *      RTC clk -> 1 HZ
 */


#include "stm32f446xx.h"
#include <string.h>
#include <stdio.h>



#define LOW 					0
#define BTN_PRESSED 			LOW
#define HIGH 					1
#define BTN_NOT_PRESSED 		HIGH

#define RTC_SYNCPRESCALER_1HZ   0xFF
#define RTC_ASYNCPRESCALER_1HZ	0x7F

RTC_Time_t readTimeDate;
RTC_Handle_t rtcHandle;

const char *weekDayStr[] = {"Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"};
const char *amPmStr[] = {"AM", "PM"};


/*
 * GPIO-Button INit
 */
void GPIO_Button_Inits(void){
	GPIO_Handle_t GpioButton;

	GpioButton.pGPIOx = GPIOC;
	GpioButton.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GpioButton.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioButton.GPIO_PinConfig.GPIO_PinOPSpeed = GPIO_SPEED_FAST;
	GpioButton.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_NOPUPD;

	GPIO_Init(&GpioButton);

}

/*
 * delay
 */
void delay (void){
	/* ~200 msec when sys clock is 16 MHZ */
	for(uint32_t i = 0; i < 500000/2; i ++);
}


/*
 * WAIT_ForButtonPress
 * Polling button
 */
void WAIT_ForButtonPress (void){

	while(GPIO_ReadFromInputPin(GPIOC, GPIO_PIN_NO_13) == BTN_NOT_PRESSED);

	/* debounce */
	delay();
}



int main(void){

	/* Initialize the button */
	GPIO_Button_Inits();

	/*rtc clk initialization */
	rtcHandle.RTC_Config.Sync_Prescaler = RTC_SYNCPRESCALER_1HZ;
	rtcHandle.RTC_Config.Clock_Source = RTC_CLKSRC_LSE;
	rtcHandle.RTC_Config.Async_Prescaler = RTC_ASYNCPRESCALER_1HZ;
	rtcHandle.RTC_Config.hour_format = RTC_HOUR_FMT_24;

	/* rtc date and time init */
	rtcHandle.RTC_Time.Day = 30;
	rtcHandle.RTC_Time.Month = 8;
	rtcHandle.RTC_Time.Year = 25;

	rtcHandle.RTC_Time.Hours = 11;
	rtcHandle.RTC_Time.Minutes = 45;
	rtcHandle.RTC_Time.Seconds = 0;
	rtcHandle.RTC_Time.Weekday = 6;

	RTC_Init(&rtcHandle);



	while(1){

		/* send command after the button is pressed */
		WAIT_ForButtonPress();

		/* Read Time and Date */
		RTC_GetTimeDate(&readTimeDate);

		printf("Date : %02u : %02u : %02u\n", readTimeDate.Day, readTimeDate.Month, readTimeDate.Year);
		printf("Time : %02u : %02u : %02u\n", readTimeDate.Hours, readTimeDate.Minutes, readTimeDate.Seconds);
		printf("Day of the week: %s\n", weekDayStr[readTimeDate.Weekday]);
	}


	return 0;
}
